[
  { "id": 1, "text": "Don't like to give orders, like to improve everything, You are included." },
  { "id": 2, "text": "Love results, hate processes. If there is a way to get results without process, I will definitely find it." },
  { "id": 3, "text": "I'm a lion person (like a cat one but with a loud roar)." },
  { "id": 4, "text": "If I repeat 10 times this is not possible, it means I have some proofs. It won't become possible if you ignore them." },
  { "id": 5, "text": "Like to move by small steps, don't like rushing." },
  { "id": 6, "text": "Like to get maximum out of what I have, won't search for something new if I can use the existing one." },
  { "id": 7, "text": "Hate spaghetti. If you would like to hear my roar, start asking to make ones 10 times in a row." },
  { "id": 8, "text": "I know that someone said 'Why do you expect different results by doing the same thing again and again?' — it doesn't work on me. I get new results on the same input again and again. If results come to stability, this means I'm sure there is no other way." },
  { "id": 9, "text": "Hate to do everything by myself. We are who we are due to uniting, not because someone had big biceps." },
  { "id": 10, "text": "Brains are a muscle. If you need them, you must train them. Ask me and I will give you some tips! But don't cry when your brain starts crushing." },
  { "id": 11, "text": "Don't say 'Maris, I'm okay with it' if it's not true. I will eat you like an ice-cream (with taste)." },
  { "id": 12, "text": "Love predictable risk, hate risks that are not calculated." },
  { "id": 13, "text": "If I fall, I will jump right back. Anything that doesn't kill me makes me stronger." },
  { "id": 14, "text": "Don't be scared that you will harm my feelings. If that happens, your feelings will be in the same state." },
  { "id": 15, "text": "I'm a mirror — I throw back everything you throw at me (it will fly even if I won't be able to lift it)." },
  { "id": 16, "text": "Try harder is good, but think smarter is better!" },
  { "id": 17, "text": "If you ask me to do something in the middle of the night, it will be done. But I will expect that we’ll work to make sure it never happens again." },
  { "id": 18, "text": "I believe that valuable things need time. If you make something fast, why do you expect it to live another day without a problem?" },
  { "id": 19, "text": "If I can calculate it, I won't do it — as the result is fully predictable." },
  { "id": 20, "text": "Lazy bastard making the maximum out of doing nothing." },
  { "id": 21, "text": "The only place where I stopped automating everything is games, because then you need to find a new one." },
  { "id": 22, "text": "My ideas are unique. If you think they are not, then you just never discussed anything with me." },
  { "id": 23, "text": "I respect all people, no matter their status, skills, or any other thing that seems important for most people." }
]