{
  "title": [
    {"id": 1, "text": "Please notice that I will write only what I can and remember."},
    {"id": 2, "text": "Everything related to server means you have PC with hard drive and ssh connection, after that you make everything to get final result"}
  ],
  "pingnetGames": [
    "TODO ??"
  ],
  "Dynatech": [
    {"id": 3, "text": "Hay Maris we have random bug appearing here and there // found problem related to generated js uniting hash intersection"},
    {"id": 4, "text": "Hay Maris we have 2 frameworks 95% of code is same. please make something to keep only 1 of them. done by adjusting logic and deleting one of them"},
    {"id": 5, "text": "Hey Maris we have page that is glitching on raspberry pi we need optimize it. optimization done, implemention of all requirements."},
    {"id": 6, "text": "Hey Maris we have tons of phone numbers and we need an API that will make round robin on phone numbers. Done (from 2 try and with some help from TL)"},
    {"id": 7, "text": "Hey Maris we need to optimize table it's not displaying in time. (done)"},
    {"id": 8, "text": "Hey Maris we would like you to move to services, what it is ? some useful services. okay"},
    {"id": 9, "text": "Hey Maris we have JQGrid and I'm exhausted to make new grids. Made MVC styled working relation (you define model everything else is adjusting to it.)"},
    {"id": 10, "text": "Hey Maris you created trash it is working slow, made some investigations looks like MyISAM is not best engine for joining. (created relation mapping without joins) - yee it's fine"},
    {"id": 11, "text": "Hey Maris we have Status Monitoring tool that is working slow please optimize it. Optimized from 20 seconds each service to 1 second for all services."},
    {"id": 12, "text": "Hey Maris Full text search by template content is working slow or failing with out of memory. made phrase searching tool to find emails tha contains phrase \"Hello\" without load."},
    {"id": 13, "text": "Hey Maris we have trouble, someone forgot to pay for HDD and our all mail templates had gone. after 3 hours I switched logic to gather templates data from audit table, not FS"},
    {"id": 14, "text": "Hey Maris Our Price service is failing time to time. Found index that is used rarely and when is used makes full table lock while reading data into memory."},
    {"id": 15, "text": "Hey Maris would you be teamlead ? sure why not but I can't promise you anything"},
    {"id": 16, "text": "At last Maris take those 35 services and now you are responsible them to run fully on production"},
    {"id": 17, "text": "I need upgrade PHP. (done)"},
    {"id": 18, "text": "I need implement Docker. (done)"},
    {"id": 19, "text": "I need implement mail system optimization. (done)"},
    {"id": 20, "text": "We need new SMS service. (done by colleague)"},
    {"id": 21, "text": ".... tons of things like this is broken that is broken lets deploy, okay we made it wrong ...."},
    {"id": 22, "text": "Lets hire PM ? Why you need it ? I can't code while I'm listening to 10 different people problems, and can't prioritize something as everyone is just crying."},
    {"id": 23, "text": "Okay I wan't to change something, need to leave company. Will start from asking to replace me as TL, everything is kind a more stable."},
    {"id": 24, "text": "2 Years of doing things like optimize this optimize that."},
    {"id": 25, "text": "Maris we need an tool that will some how generate expiring tokens auto integrate into this generator, and have full access control somewhere in GUI. (done)"},
    {"id": 26, "text": "Maris we need something to detect closes hotel to airports, here is geo data please make something we can work with. (table with optimal searches on closest locations)"},
    {"id": 27, "text": "at June 2019 I sed &gt;&gt; I will leave at June 2020. (reason would like to move from PHP to JAVA)"},
    {"id": 28, "text": "March 2020 (pandemic have come) offer for everyone to leave or divide salary in half with compensations at December. I left"}
  ],
  "StockGuru": [
    {"id": 1, "text": "somewhere between Dyninno"},
    {"id": 2, "text": "Hay we have https://www.thomsonreuters.com/ and would like to migrate everything to https://www.bloomberg.com/, are you okay ? I don't know anything about finances. No problem here is test task"},
    {"id": 3, "text": "Gathered prices with historical entries using thomsonreuters. Got offer with words we had 10 candidates you where only one who have done the task."},
    {"id": 4, "text": "Hay Maris I promised you that we will make JAVA app for handling everything but there is problem. We have to drop subscription for thomson so please Take this excel .... and reworking it to Bloomberg."},
    {"id": 5, "text": "1 month all API calls reworked to Bloomberg"},
    {"id": 6, "text": "Made some beta API to proxy requests for internal use Bloomberg, 1 subscription 1 PC only, so we had to make something to allow multiple PC exploit one Subscription."},
    {"id": 7, "text": "after we dropped thomson subscription I told that I hate windows (this was part of true) and would like to move back to prev company (promised to come back after I get driving License, didn't say that to not harm Feelings of Sergejs.)"},
    {"id": 8, "text": "Sergejs boss came and tried to convince me that he will solve all problems with Sergey I just need to stay and continue to work."},
    {"id": 9, "text": "One month journey"}
  ],
  "Unemployed": [
    {"id": 1, "text": "Try to convince JAVA devs that I'm good dev not thrown out from Dynatech for bad results. no success"},
    {"id": 2, "text": "Started to send CV to Senior PHP roles. Got 1 final meeting where I screwed by saying to person who made the test, that test is not Senior level."},
    {"id": 3, "text": "Found offer from SDAC Academy as Software developers pattern Mentor (1 weekend in 2 month for 2 lectures)"},
    {"id": 4, "text": "SDA Academy worked for half an year, left due to lack of time (updating materials needed to work for AGC Soft)"},
    {"id": 5, "text": "Got offer from IT Labs // AGC Soft"}
  ],
  "AGC": [
    {"id": 1, "text": "Hello we have legacy web pages we need to rework it from Phalcon to Symfony and transfer web to our responsibility, don't say any one where you are working"},
    {"id": 2, "text": "Tons of Backend fixes (optimization, bug fixes) Maris you are good dev so we will work with you (have heard after 6 weeks of work here.)"},
    {"id": 3, "text": "Hay Maris we like how you work, you told that You like Java don't whana go on Mobile app development team ?? there is JAVA ? no there is Kotlin. than no."},
    {"id": 4, "text": "Hay Maris we have huge tasks for CMS list and we need to rework it to symfony don't whana go there ? why not ?"},
    {"id": 5, "text": "Made hybrid Phalcon + Symfony with fully working "},
    {"id": 6, "text": "Created Translation service"},
    {"id": 7, "text": "Maris mb we can promote you to TL ? Who I will lead if we have only 2 persons in team ? Like Hey Alexander I'm your boss ?"},
    {"id": 8, "text": "Created tons of new functionality for page control"},
    {"id": 9, "text": "Reworked all existing functionality to Symfony (mainly I was doing the job) and only me was planing anything"},
    {"id": 10, "text": "All hotfixes, Performance optimizations and tons of such distracting cases was handled almost always by me."},
    {"id": 11, "text": "Drop Phalcon from dependencies."},
    {"id": 12, "text": "Came offer from CTCO to switch to JAVA without huge salary drop"},
    {"id": 13, "text": "Counter offer from AGC Soft (salary increase for 14%)"},
    {"id": 14, "text": "Sorry lets decide when I'm leaving. We need you till March, okay."}
  ],
  "CTCO": [
    {"id": 1, "text": "Hey we got some Excel calculating service that need some work in it."},
    {"id": 2, "text": "Hey we need to upgrade JAVA. (done)"},
    {"id": 3, "text": "Okay to do it we need upgrade Spring boot. (done)"},
    {"id": 4, "text": "Hey we have problem file saving service works slow. I offered something (all devs told this is madness) Sergey told lets give it try"},
    {"id": 5, "text": "Made optimization, file upload without workflow change came from 10-100 seconds (with timeouts time to time) to below 1 second with complex flow"},
    {"id": 6, "text": "Hey we have some tool where are some names and companies, it is working on GWT (Google Web Toolkit), need fixes here and there. (done)"},
    {"id": 7, "text": "Hey we have to high payments for subscription, our logs are about 1 GB per day Maris please decrease. Decreased to 10MB by reducing INFO logs to 1% from 100%, azure agent configuration"},
    {"id": 8, "text": "Hey we have problems locally project is booting on Azure no (found some fix)."},
    {"id": 9, "text": "We need to change proxy for our dockers &gt; go and fix it. done"},
    {"id": 10, "text": "Okay we have business optimization we need to move 2 persons somewhere and replace with Indian guys, let it be newest project members"},
    {"id": 11, "text": "Bye Sergey hello Alexey"},
    {"id": 12, "text": "Promoted from Middle to Lead. (when Senior dev heard that I was middle he was very surprised.)"},
    {"id": 13, "text": "Hi we need to fix here nightly pipeline. Done"},
    {"id": 14, "text": "Hi we need to recover database we have unstable one. I'm working here 2 days and in 2 days I go to vocation mb some how to ask some one else ? or wait while I'm back?"},
    {"id": 15, "text": "Hi we have LTPA Auth need to rework to OAUTH here is some PR we closed 2 years ago make same one after 1 month we need to drop LTPA. Done"},
    {"id": 16, "text": "Hi we need fix this that than create something here."},
    {"id": 17, "text": "Hi we need to implement ADR lets implement. Maris Can you start by writing ADR on new task ? what is new task, rework deploy pipelines to not use websphere. Done"},
    {"id": 18, "text": "Reworking Authorizations from Internal tokens to Azure permission control"},
    {"id": 19, "text": "Maris we need to test Disaster recovery, and put some guideline what to do to recover DB from backups. Done."},
    {"id": 20, "text": "Maris we have service it is based on Orika mapper that is legacy we need to rework to Mapstruct. But our project is one big mapping from A to B and from B to A no other logic. Ye it's kind a not easy one"},
    {"id": 21, "text": "Hey I'm done. Maris you didn't use all Mapstruct logic during refactoring, mb lets deploy something that works ? than start to rework each field to Mapstruct provided paths ? No this will never happen lets do everything right away."},
    {"id": 22, "text": "Hey I would like to increase salary ? Maris in this project you don't have budget but we have startup clear without legacy where you can get something. Okay"},
    {"id": 23, "text": "By Alexey Hello Vitaliy"},
    {"id": 24, "text": "Startup without legacy started with Background check. for 1 month just sleeping eating and listening podcasts about banking"},
    {"id": 25, "text": "Background check passed. Welcome to our organization we need small Learnings (Study whole Cross border payments flows for PAIN, PACS, CAMT) study swift. here are learning one and course for 1 month. Done"},
    {"id": 26, "text": "Hello here is our project (32GB of generated code using VTK and some scripts for generation made localy by organization)"},
    {"id": 27, "text": "Hello when I try to start project it fails with problem out of memory, maybe you can give 64GB of memory instead of 32GB as is described in Minimal requirements of project setup. No it's to hard and expensive and don't guaranty results."},
    {"id": 28, "text": "Some bug fixes, work by trying to execute any tests, (after 2 month of work some one got agreement to create page file to reduce problems) I offered to make swap on first day I noticed out of Memory"},
    {"id": 29, "text": "Hello here we have two new features on child project. Done with tons of problems but still some how"},
    {"id": 30, "text": "Hello we have success on our feature. some bugs"},
    {"id": 31, "text": "Hello Can I promote to senior ? Lets try"},
    {"id": 32, "text": "<Paragraph>You have failed Soft skills <a href={SoftSkills}>I have huge problems here</a></Paragraph>"},
    {"id": 33, "text": "You have failed Hard skills, okay why ? We are scared to say yes, you talk to much say to much details we don't know so we can't make decision as we doesn't understand know you or no. (pointed items they didn't ask in interview at all as what to improve). We are sure you will pass it next time in 3 month"},
    {"id": 34, "text": "There is another feature, related to primary project, what we should do? just upgrade API from this folder to import maven from this. we have made mvn version just make sure everything is working"},
    {"id": 35, "text": "This feature was never done. Company reduced contract from 45 people to 14 than to 13"},
    {"id": 36, "text": "Bye Vitaliy Hello branch"},
    {"id": 37, "text": "can you take vocation while we search for position ?"},
    {"id": 38, "text": "2 meetings 1 answer &gt; you will be bored in our project. 2 okay. but you need to learn go"},
    {"id": 39, "text": "Hello can I make promotion ? no you can't do it earlier than after 8 month of full fail. But they told, doesn't care what they told here is written that not earlier than 8 month. (the moment I understood that I need to leave)"},
    {"id": 40, "text": "start learning go"},
    {"id": 41, "text": "Bye branch Hello Pyotr."},
    {"id": 42, "text": "Made 2 tasks in first week gone to planed vocation."},
    {"id": 43, "text": "in vocation good offer from Sapiens"},
    {"id": 44, "text": "Hello I have offer, (lets see how much they offered you ? about 25% of salary) hmm you have problems with projects so okay we won't beat it"}
  ],
  "Sapiens": [
    {"id": 1, "text": "Hello have you worked in AWS ? no"},
    {"id": 2, "text": "Hello have you worked with Reactive Java ? no"},
    {"id": 3, "text": "Okay here are tasks. (.. tons of tasks like, junior level)"},
    {"id": 4, "text": "Hello we have migration it is almost ready we was working for 6 months to make everything, dev who made everything leaves can you continue ? okay no problem."},
    {"id": 5, "text": "Maris we don't like that you refactor something, But this is spaghetti, doesn't matter we just migrate and drop. don't change anything"},
    {"id": 6, "text": "Maris why you created table, to not put different database data into 1 table I would like to see 2. But everyone is putting it inside this table."},
    {"id": 7, "text": "Maris Please put this data into this table Conversation ID you put in conversation_id field. Stop but my conversation id is UUID table definition is Integer, maybe you made mistake? no Maris you are idiot just do what I have told you to do!"},
    {"id": 8, "text": "Hello how is my probation period ? We can't say anything this is complex scheme just if we will migrate you will be fine, just do the tasks"},
    {"id": 9, "text": "Maris how you are going ? I'm fine only problem I can't understand whats wrong. I have 6 PR waiting and no feedback from TL. He is fast he will do everything, but maybe we can change somehow to remove this bottle neck ?"},
    {"id": 10, "text": "Next day from 11PR From whole team left 4. 2 from my side with comments"},
    {"id": 11, "text": "I made in 2 weeks in total 10 PR with tasks on TL."},
    {"id": 12, "text": "Migration have been done. prod fell down due to huge record count and one not optimal query."},
    {"id": 13, "text": "Here is task we need to optimize, created something in 1 hour. Came to boss he told that my query is less optimal than chat GPT one"},
    {"id": 14, "text": "Got angry created optimization using Aggregation table. Came showed told just launch it and see that from 20 seconds per 1 query it now works 8 MS per 2. hm there is updates inserts new table, no this is to complex, I will find better solution."},
    {"id": 15, "text": "HR came to TL. HR. Hi how Maris is going. TL. Can't say right now need more time. HR. deadline is today. TL. okay he is okay with Junior tasks, but with middle he have problems. (probably remember discussion where I told that UUID is not compatible with integer, and you can't convert it without data loss risk)"},
    {"id": 16, "text": "We are sorry to say but we are terminating contract."}
  ],
  "SomethingGoneWrong": [
    {"id": 1, "text": "WTF, I don't know how it happened and why I am in situation like this."},
    {"id": 2, "text": "Okay I need to create personal page to increase possibility of recruiting."},
    {"id": 3, "text": "I need to start use AI tools like ChatGPT. Okay lets do Homepage together."},
    {"id": 4, "text": "3 days and I'm writing this line to push it to existing personal page."}
  ]
}